; domain
(define (domain emergencia)
  (:requirements :strips :typing)

  (:types
    location
    person
    crate
    content
    drone
  )

  (:predicates
    (at-drone ?d - drone ?l - location)
    (at-person ?p - person ?l - location)
    (at-crate ?c - crate ?l - location)

    (has-content ?c - crate ?con - content)
    (has ?p - person ?con - content)

    (free-arm1 ?d - drone)
    (free-arm2 ?d - drone)

    (carrying-arm1 ?d - drone ?c - crate)
    (carrying-arm2 ?d - drone ?c - crate)

    (available ?c - crate)
  )

  (:action fly
    :parameters (?d - drone ?from - location ?to - location)
    :precondition
      (at-drone ?d ?from)
    :effect
      (and
        (not (at-drone ?d ?from))
        (at-drone ?d ?to)
      )
  )

  (:action pickup-arm1
    :parameters (?d - drone ?c - crate ?l - location)
    :precondition
      (and
        (at-drone ?d ?l)
        (at-crate ?c ?l)
        (free-arm1 ?d)
        (available ?c)
      )
    :effect
      (and
        (not (at-crate ?c ?l))
        (not (free-arm1 ?d))
        (not (available ?c))
        (carrying-arm1 ?d ?c)
      )
  )

  (:action pickup-arm2
    :parameters (?d - drone ?c - crate ?l - location)
    :precondition
      (and
        (at-drone ?d ?l)
        (at-crate ?c ?l)
        (free-arm2 ?d)
        (available ?c)
      )
    :effect
      (and
        (not (at-crate ?c ?l))
        (not (free-arm2 ?d))
        (not (available ?c))
        (carrying-arm2 ?d ?c)
      )
  )

  (:action deliver-arm1
    :parameters (?d - drone ?c - crate ?p - person ?con - content ?l - location)
    :precondition
      (and
        (at-drone ?d ?l)
        (at-person ?p ?l)
        (carrying-arm1 ?d ?c)
        (has-content ?c ?con)
      )
    :effect
      (and
        (not (carrying-arm1 ?d ?c))
        (free-arm1 ?d)
        (has ?p ?con)
      )
  )

  (:action deliver-arm2
    :parameters (?d - drone ?c - crate ?p - person ?con - content ?l - location)
    :precondition
      (and
        (at-drone ?d ?l)
        (at-person ?p ?l)
        (carrying-arm2 ?d ?c)
        (has-content ?c ?con)
      )
    :effect
      (and
        (not (carrying-arm2 ?d ?c))
        (free-arm2 ?d)
        (has ?p ?con)
      )
  )
)

; problem
(define (problem drone_problem_d1_r0_l7_p7_c7_g7_ct2)
(:domain emergencia)
(:objects
	drone1 - drone
	depot - location
	loc1 - location
	loc2 - location
	loc3 - location
	loc4 - location
	loc5 - location
	loc6 - location
	loc7 - location
	crate1 - crate
	crate2 - crate
	crate3 - crate
	crate4 - crate
	crate5 - crate
	crate6 - crate
	crate7 - crate
	food - content
	medicine - content
	person1 - person
	person2 - person
	person3 - person
	person4 - person
	person5 - person
	person6 - person
	person7 - person
)
(:init
	(at-drone drone1 depot)
	(free-arm1 drone1)
	(free-arm2 drone1)
	(at-crate crate1 depot)
	(available crate1)
	(at-crate crate2 depot)
	(available crate2)
	(at-crate crate3 depot)
	(available crate3)
	(at-crate crate4 depot)
	(available crate4)
	(at-crate crate5 depot)
	(available crate5)
	(at-crate crate6 depot)
	(available crate6)
	(at-crate crate7 depot)
	(available crate7)
	(has-content crate1 food)
	(has-content crate2 food)
	(has-content crate3 food)
	(has-content crate4 food)
	(has-content crate5 medicine)
	(has-content crate6 medicine)
	(has-content crate7 medicine)
	(at-person person1 loc3)
	(at-person person2 loc5)
	(at-person person3 loc6)
	(at-person person4 loc2)
	(at-person person5 loc5)
	(at-person person6 loc4)
	(at-person person7 loc4)
)
(:goal (and
	(at-drone drone1 depot)
	(has person3 food)
	(has person3 medicine)
	(has person5 food)
	(has person5 medicine)
	(has person6 food)
	(has person7 food)
	(has person7 medicine)
	))
)

; plan
1. (pickup-arm2 drone1 crate7 depot)
   deleted: (at-crate crate7 depot) (free-arm2 drone1) (available crate7)
   added: (carrying-arm2 drone1 crate7)
   goals met: 1 of 8
2. (pickup-arm1 drone1 crate4 depot)
   deleted: (at-crate crate4 depot) (free-arm1 drone1) (available crate4)
   added: (carrying-arm1 drone1 crate4)
   goals met: 1 of 8
3. (fly drone1 depot loc6)
   deleted: (at-drone drone1 depot)
   added: (at-drone drone1 loc6)
   goals met: 0 of 8
4. (deliver-arm2 drone1 crate7 person3 medicine loc6)
   deleted: (carrying-arm2 drone1 crate7)
   added: (free-arm2 drone1) (has person3 medicine)
   goals met: 1 of 8
5. (deliver-arm1 drone1 crate4 person3 food loc6)
   deleted: (carrying-arm1 drone1 crate4)
   added: (free-arm1 drone1) (has person3 food)
   goals met: 2 of 8
6. (fly drone1 loc6 depot)
   deleted: (at-drone drone1 loc6)
   added: (at-drone drone1 depot)
   goals met: 3 of 8
7. (pickup-arm2 drone1 crate6 depot)
   deleted: (at-crate crate6 depot) (free-arm2 drone1) (available crate6)
   added: (carrying-arm2 drone1 crate6)
   goals met: 3 of 8
8. (pickup-arm1 drone1 crate3 depot)
   deleted: (at-crate crate3 depot) (free-arm1 drone1) (available crate3)
   added: (carrying-arm1 drone1 crate3)
   goals met: 3 of 8
9. (fly drone1 depot loc5)
   deleted: (at-drone drone1 depot)
   added: (at-drone drone1 loc5)
   goals met: 2 of 8
10. (deliver-arm2 drone1 crate6 person5 medicine loc5)
   deleted: (carrying-arm2 drone1 crate6)
   added: (free-arm2 drone1) (has person5 medicine)
   goals met: 3 of 8
11. (deliver-arm1 drone1 crate3 person5 food loc5)
   deleted: (carrying-arm1 drone1 crate3)
   added: (free-arm1 drone1) (has person5 food)
   goals met: 4 of 8
12. (fly drone1 loc5 depot)
   deleted: (at-drone drone1 loc5)
   added: (at-drone drone1 depot)
   goals met: 5 of 8
13. (pickup-arm2 drone1 crate5 depot)
   deleted: (at-crate crate5 depot) (free-arm2 drone1) (available crate5)
   added: (carrying-arm2 drone1 crate5)
   goals met: 5 of 8
14. (pickup-arm1 drone1 crate2 depot)
   deleted: (at-crate crate2 depot) (free-arm1 drone1) (available crate2)
   added: (carrying-arm1 drone1 crate2)
   goals met: 5 of 8
15. (fly drone1 depot loc4)
   deleted: (at-drone drone1 depot)
   added: (at-drone drone1 loc4)
   goals met: 4 of 8
16. (deliver-arm2 drone1 crate5 person7 medicine loc4)
   deleted: (carrying-arm2 drone1 crate5)
   added: (free-arm2 drone1) (has person7 medicine)
   goals met: 5 of 8
17. (deliver-arm1 drone1 crate2 person6 food loc4)
   deleted: (carrying-arm1 drone1 crate2)
   added: (free-arm1 drone1) (has person6 food)
   goals met: 6 of 8
18. (fly drone1 loc4 depot)
   deleted: (at-drone drone1 loc4)
   added: (at-drone drone1 depot)
   goals met: 7 of 8
19. (pickup-arm2 drone1 crate1 depot)
   deleted: (at-crate crate1 depot) (free-arm2 drone1) (available crate1)
   added: (carrying-arm2 drone1 crate1)
   goals met: 7 of 8
20. (fly drone1 depot loc4)
   deleted: (at-drone drone1 depot)
   added: (at-drone drone1 loc4)
   goals met: 6 of 8
21. (deliver-arm2 drone1 crate1 person7 food loc4)
   deleted: (carrying-arm2 drone1 crate1)
   added: (free-arm2 drone1) (has person7 food)
   goals met: 7 of 8
22. (fly drone1 loc4 depot)
   deleted: (at-drone drone1 loc4)
   added: (at-drone drone1 depot)
   goals met: 8 of 8
